eisup_2019_docmng_integration/src/Catalogs/СпособыОтраженияРасходовПоАмортизации/СпособыОтраженияРасходовПоАмортизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияРасходовПоАмортизации</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗатратНаВыпуск</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыСпособыОтраженияАмортизации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Способы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>СтатьяЗатрат</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <comment>(Упр)</comment>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаПродукции</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <comment>(Регл)</comment>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоНУ1</name>
      <comment>(Регл)</comment>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <comment>(Регл)</comment>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоНУ2</name>
      <comment>(Регл)</comment>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <comment>(Регл)</comment>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоНУ3</name>
      <comment>(Регл)</comment>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособСтроительства</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыСпособыОтраженияАмортизации/абс_СтатусыСпособыОтраженияАмортизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыСпособыОтраженияАмортизации</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>Использование</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусОрганизации/абс_СтатусОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусОрганизации</name>
  <enumValues>
    <name>ГоловнаяОрганизация</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ДЗО</name>
  </enumValues>
  <enumValues>
    <name>ОбособленноеПодразделение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/СпособыОтраженияРасходовПоАмортизации/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда 
		абс_Статус = Перечисления.абс_СтатусыСпособыОтраженияАмортизации.Подготовка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда 
		абс_Статус = Перечисления.абс_СтатусыСпособыОтраженияАмортизации.Подготовка;
	КонецЕсли;
	
КонецПроцедуры

//АБС ВСТАВКА 48810  24.10.2014 9:28:23  Шамов
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоНовый()
		И (Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.ДЗО
			ИЛИ Организация.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.Филиал) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Необходимо использовать существующие утвержденные способы отражения!", Отказ);
	КонецЕсли;
КонецПроцедуры
//АБС ВСТАВКА 48810 КОНЕЦ
